CSI API ETABS v1
cDetailing.GetDetailedColumnStackGuidData Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetDetailedColumnStackGuidData(
	string ColumnStackID,
	string SimilarFirstColumnUniqueID,
	ref string[] LongitudinalBars,
	ref string[] TiesA,
	ref string[] TiesB,
	ref string[] TiesC
)
Function GetDetailedColumnStackGuidData (
	ColumnStackID As String,
	SimilarFirstColumnUniqueID As String,
	ByRef LongitudinalBars As String(),
	ByRef TiesA As String(),
	ByRef TiesB As String(),
	ByRef TiesC As String()
) As Integer
Dim instance As cDetailing
Dim ColumnStackID As String
Dim SimilarFirstColumnUniqueID As String
Dim LongitudinalBars As String()
Dim TiesA As String()
Dim TiesB As String()
Dim TiesC As String()
Dim returnValue As Integer
returnValue = instance.GetDetailedColumnStackGuidData(ColumnStackID,
	SimilarFirstColumnUniqueID, LongitudinalBars,
	TiesA, TiesB, TiesC)
int GetDetailedColumnStackGuidData(
	String^ ColumnStackID,
	String^ SimilarFirstColumnUniqueID,
	array<String^>^% LongitudinalBars,
	array<String^>^% TiesA,
	array<String^>^% TiesB,
	array<String^>^% TiesC
)
abstract GetDetailedColumnStackGuidData :
        ColumnStackID : string *
        SimilarFirstColumnUniqueID : string *
        LongitudinalBars : string[] byref *
        TiesA : string[] byref *
        TiesB : string[] byref *
        TiesC : string[] byref -> int
Parameters
ColumnStackID
Type: System.String
SimilarFirstColumnUniqueID
Type: System.String
LongitudinalBars
Type: System.String[]
TiesA
Type: System.String[]
TiesB
Type: System.String[]
TiesC
Type: System.String[]
Return Value
Type: Int32
See Also
Reference
cDetailing Interface
ETABSv1 Namespace